In [1]:
!pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\aayush\anaconda3\lib\site-packages (2.2.9)

In [4]:
import mysql.connector
#importing database
database = mysql.connector.connect(host="localhost",user="root",password="")
db = database.cursor()    # server ko connction hold gareko

In [6]:
sql = "CREATE DATABASE pythons10"     ## db created
db.execute(sql)

In [7]:

database = mysql.connector.connect(host="localhost",
                                   user="root",
                                   password="",
                                   database = "pythonclass530")    # database saga connect garne

db = database.cursor() ## database saga connect garera hold gareko. yeslai chaiyeko bela use garne



sql = "CREATE TABLE subject(id INT, name VARCHAR(255))"   # normal and simple table
db.execute(sql)

In [9]:

# to make larger table in detailed just like we created manually.
sql = '''CREATE TABLE `students` (
  `sn` int(11) NOT NULL,
  `name` varchar(200) COLLATE utf8_unicode_ci NOT NULL,
  `physics` float NOT NULL DEFAULT 0,
  `chemistry` float NOT NULL DEFAULT 0,
  `math` float NOT NULL DEFAULT 0,
  `english` float NOT NULL DEFAULT 0,
  `nepali` float NOT NULL DEFAULT 0,
  `total` float NOT NULL DEFAULT 0,
  `per` float NOT NULL DEFAULT 0,
  `grade` varchar(5) COLLATE utf8_unicode_ci NOT NULL DEFAULT 'F'
)'''
db.execute(sql)

In [11]:
# Insert data
import mysql.connector
database = mysql.connector.connect(host="localhost",
                                   user="root",
                                   password="",
                                   database = "pythonclass530")
db = database.cursor()
sql = '''INSERT INTO student (sn, name, physics, chemistry, math, english, nepali, total, per, grade) 
VALUES (8, 'Harry', 78, 76, 90, 56, 56, 400, 80, 'A');'''

db.execute(sql)   # db ma halxa
database.commit()  # commit nagarunjel samma change dekhidaina ### commit garne bela 'databse' use garne

In [12]:

## taking input from user and inserting into database


n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    physics = int(input("Enter physics  marks = "))
    chemistry = int(input("Enter chemistry marks = "))
    math = int(input("Enter math marks = "))
    english = int(input("Enter english marks = "))
    nepali = int(input("Enter nepali marks ="))
    total = physics+chemistry+math+english+nepali
    per = total/5
    if per >= 80:
        grade = 'A'
    elif per >= 60:
        grade = 'B'
    elif per >= 50:
        grade = 'C'
    else:
        grade = 'F'

    print(grade,"Grade")
    sql = f'''INSERT INTO student (name, physics, chemistry, math, english, nepali, total, per, grade) 
    VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}');'''
    db.execute(sql)
    
database.commit()

Enter n = 1
Enter name = Sarita
Enter physics  marks = 89
Enter chemistry marks = 90
Enter math marks = 67
Enter english marks = 76
Enter nepali marks =45
B Grade

In [14]:
## Reading data from database

sql = "SELECT * FROM student"
db.execute(sql)

db.fetchall()   ## tuple ko format ma aayo

[(1, 'Ram Prasad', 78.0, 90.0, 78.0, 96.0, 45.0, 400.0, 80.5, 'A'),
 (2, 'Shyam', 78.0, 50.0, 100.0, 87.0, 70.0, 410.0, 82.5, 'A'),
 (3, 'Shyama', 88.0, 50.0, 100.0, 87.0, 70.0, 410.0, 84.5, 'A'),
 (4, 'Shyama', 88.0, 50.0, 100.0, 87.0, 70.0, 410.0, 84.5, 'A'),
 (7, 'Hari', 78.0, 76.0, 90.0, 56.0, 56.0, 400.0, 80.0, 'A'),
 (8, 'Harry', 78.0, 76.0, 90.0, 56.0, 56.0, 400.0, 80.0, 'A'),
 (9, 'Sarita', 89.0, 90.0, 67.0, 76.0, 45.0, 367.0, 73.4, 'B')]

In [16]:
## reading with condition

sql = "SELECT * FROM student WHERE grade = 'B'"
db.execute(sql)

db.fetchall()

[(9, 'Sarita', 89.0, 90.0, 67.0, 76.0, 45.0, 367.0, 73.4, 'B')]

In [17]:
## Deleting with condition

sql = "DELETE FROM student WHERE sn = 9"
db.execute(sql)

database.commit()   ## database changed so, commit garnuparyo

In [18]:
# update

sql = "UPDATE student SET name = 'Rama' WHERE name = 'Ram'"
db.execute(sql)
database.commit()